import java.io.*;

/*
 11시 50분 - 12시 30분
항성계를 만날때마다 시그널 메시지를 이용해 기록
N * M 개의 직사각형, 탐사선은 상하좌우 중 시그널 보냄
행성 만나면 90도로 전파 꺽임 / \ 
블랙홀 혹은 항성계를 벗어날때까지 전파 -> 인접 칸 시간 1초!
어떻게 하면 시간 최대인지!
/ \ 행성, C는 블랙홀, .은 빈칸!
U R D L 방향 2가지 이상이면 앞서는걸로!
무한하면 Voyager를 출력!

\를 만나면 왼쪽 -> 위 아래->왼쪽 위->오른쪽 오른쪽->위
/를 만나면 왼쪽-> 위 아래-> 오른쪽 위->왼쪽 오른쪽->아래

U R D L을 맵으로 해서 표현?

언제 break될지-> 
그리고 무한 -> 방문했는데 다시 방문하면 무한이다!

 */

public class b397 {
    static int N,M;

    public static void main(String[] args) throws IOException {
     
       

    }
    

    
}
